# DelObject

## Description
Procedure DelObject deletes the referenced object from the document.

```pascal
PROCEDURE DelObject(h : HANDLE);
```

```python

def vs.DelObject(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD
## Category
* Object Editing